uhnp/src/InformationRegisters/СоответствиеВнутригрупповыхПоказателей/СоответствиеВнутригрупповыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствиеВнутригрупповыхПоказателей</name>
  <resources>
    <name>СоответствиеАналитик</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидОтчетаБазис</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОтчетаСравнение</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоказательБазис</name>
    <type>
      <types>CatalogRef.ПоказателиОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоказательСравнение</name>
    <type>
      <types>CatalogRef.ПоказателиОтчетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/ПоказателиОтчетов/ПоказателиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиОтчетов</name>
  <owners>Catalog.ВидыОтчетов</owners>
  <owners>Catalog.ШаблоныТрансформационныхКорректировок</owners>
  <attributes>
    <name>ВидИтога</name>
    <type>
      <types>EnumRef.ВидыИтоговПоказателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКурса</name>
    <type>
      <types>EnumRef.ВидыКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоказателя</name>
    <type>
      <types>EnumRef.ВидыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутриГрупповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРаскрытия</name>
    <type>
      <types>CatalogRef.ГруппыРаскрытия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействияПриАктуализации</name>
    <type>
      <types>EnumRef.ДействияПриАктуализацииБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Колонка</name>
    <type>
      <types>CatalogRef.КолонкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НеМасштабируется</name>
    <comment>Точность отображения показателя не зависит от точности отображения документа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеФинансовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаПоложительногоОтклонения</name>
    <type>
      <types>EnumRef.ВидыОценокОтклонений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйПоказатель</name>
    <type>
      <types>CatalogRef.ПоказателиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбработки</name>
    <type>
      <types>EnumRef.СпособыОбработкиПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовИРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка</name>
    <type>
      <types>CatalogRef.СтрокиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуффиксКода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>EnumRef.ТипыЗначенийПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойПоказатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетБД</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИтогаПоСчету</name>
    <type>
      <types>EnumRef.ВидыБухгалтерскихИтогов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетБД</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проверочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокУстранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньКритичности</name>
    <type>
      <types>EnumRef.УровниКритичностиКонтрольныхСоотношений</types>
    </type>
  </attributes>
  <attributes>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияРесурсов</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляОтраженияКурсовыхРазниц</name>
    <comment>//Удалить</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделениеПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПересчитыватьВалютнуюСумму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Защищенный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентТР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормализованныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>CatalogRef.ТипыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаИтогаПоПериоду</name>
    <type>
      <types>EnumRef.ВидыИтоговПоказателяПоПериоду</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСуммируется</name>
    <comment>Не суммируется при консолидации / свертке значений</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролируемыйПоказатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <comment>Наименование на дополнительном языке 1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <comment>Наименование на дополнительном языке 2</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_КонтролироватьЛимиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстаточныйПоказатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитываетсяПослеКонвертации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоказателиДляКурсовВалют</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательКурса</name>
      <type>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/InformationRegisters/СоответствиеВнутригрупповыхПоказателей/Forms/ФормаЗаписи/Module.bsl
///////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ, ИСПОЛНЯЕМЫЕ НА СЕРВЕРЕ

&НаСервере
Функция ПроверитьПолучитьДанныеАналитики(Показатель,Постфикс)
	
	Если Не ЗначениеЗаполнено(Показатель) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ПоказателиОтчетов.ГруппаРаскрытия.Ссылка КАК ГруппаРаскрытия,
	|	ПоказателиОтчетов.ГруппаРаскрытия.ВидАналитики1 КАК ВидАналитики1,
	|	ПоказателиОтчетов.ГруппаРаскрытия.ВидАналитики2 КАК ВидАналитики2,
	|	ПоказателиОтчетов.ГруппаРаскрытия.ВидАналитики3 КАК ВидАналитики3,
	|	ПоказателиОтчетов.ГруппаРаскрытия.ВидАналитики4 КАК ВидАналитики4,
	|	ПоказателиОтчетов.ГруппаРаскрытия.ВидАналитики5 КАК ВидАналитики5,
	|	ПоказателиОтчетов.ГруппаРаскрытия.ВидАналитики6 КАК ВидАналитики6,
	|	ПоказателиОтчетов.ГруппаРаскрытия.АналитикаВГО КАК НомерАналитикиВГО,
	|	ПоказателиОтчетов.ВнутриГрупповой КАК ВнутриГрупповой
	|ИЗ
	|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
	|ГДЕ
	|	ПоказателиОтчетов.Ссылка = &Показатель";
	
	Запрос.УстановитьПараметр("Показатель",Показатель);
	
	Результат=Запрос.Выполнить().Выбрать();
	Результат.Следующий();	
	
	Если НЕ (Результат.ВнутриГрупповой И Результат.НомерАналитикиВГО>0) Тогда
		ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = 'Выбранный показатель не является внутригрупповым.'"),,,СтатусСообщения.Внимание);
		
		Показатель="";
		Возврат Ложь;
		
	Иначе
		
		ЭтотОбъект["ГруппаРаскрытия"+Постфикс]		= Результат.ГруппаРаскрытия;
		ЭтотОбъект["НомерАналитикиВГО"+Постфикс]	= Результат.НомерАналитикиВГО;
		ЭтотОбъект["АналитикаВГО"+Постфикс]			= Результат["ВидАналитики"+Результат.НомерАналитикиВГО];
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции // ПроверитьПолучитьДанныеАналитики()

&НаСервере
Процедура ЗаполнитьАналитикиПоказателяБазис()
	
	ТабАналитикиБазис.Очистить();
	
	Если НЕ ПроверитьПолучитьДанныеАналитики(Запись.ПоказательБазис,"Базис") Тогда
		
		Возврат;
		
	КонецЕсли;
				
	ТаблицаАналитик=ОбщегоНазначенияУХ.ЗаполнитьВидыАналитик(ГруппаРаскрытияБазис,Истина);
	
	Для Каждого Строка ИЗ ТаблицаАналитик Цикл
		
		НоваяСтрока=ТабАналитикиБазис.Добавить();
		НоваяСтрока.ВидАналитики=Строка.ВидАналитики;
		НоваяСтрока.ПредставлениеАналитики=Строка.ПредставлениеАналитики;
		НоваяСтрока.КодАналитики=Строка.КодАналитики;
		
		СписокТипов=Новый СписокЗначений;
		СписокТипов.Добавить(Строка.ТипДанныхАналитики);
		
		НоваяСтрока.ТипДанныхАналитики=СписокТипов;
		
	КонецЦикла;
	
	ОбновитьТаблицуСоответствияАналитик();
		
КонецПроцедуры // ЗаполнитьАналитикиПоказателяБазис() 

&НаСервере
Процедура ЗаполнитьАналитикиПоказателяСравнение()
	
	ТабАналитикиСравнение.Очистить();
	
	Если НЕ ПроверитьПолучитьДанныеАналитики(Запись.ПоказательСравнение,"Сравнение") Тогда
		
		Возврат;
		
	КонецЕсли;
		
	ТаблицаАналитик=ОбщегоНазначенияУХ.ЗаполнитьВидыАналитик(ГруппаРаскрытияСравнение,Истина);
		
	Для Каждого Строка ИЗ ТаблицаАналитик Цикл
		
		НоваяСтрока=ТабАналитикиСравнение.Добавить();
		НоваяСтрока.ВидАналитики=Строка.ВидАналитики;
		НоваяСтрока.ПредставлениеАналитики=Строка.ПредставлениеАналитики;
		НоваяСтрока.КодАналитики=Строка.КодАналитики;
		
		СписокТипов=Новый СписокЗначений;
		СписокТипов.Добавить(Строка.ТипДанныхАналитики);
		
		НоваяСтрока.ТипДанныхАналитики=СписокТипов;
		
	КонецЦикла;
		
КонецПроцедуры // ЗаполнитьАналитикиПоказателяСравнение()

&НаСервере
Процедура ОбновитьТаблицуСоответствияАналитик()
	
	СоответствияАналитик.Очистить();

	Для Каждого СтрАналитика ИЗ ТабАналитикиБазис Цикл
		
		НоваяСтрока=СоответствияАналитик.Добавить();
		НоваяСтрока.АналитикаБазис=СтрАналитика.ПредставлениеАналитики;
		НоваяСтрока.КодАналитикиБазис=СтрАналитика.КодАналитики;
		НоваяСтрока.ВидАналитикиБазис=СтрАналитика.ВидАналитики;
		НоваяСтрока.ТипДанныхАналитикиБазис=СтрАналитика.ТипДанныхАналитики;
			
		МассивСоответствий=УстановленныеСоответствия.НайтиСтроки(Новый Структура("КодАналитикиБазис",СтрАналитика.КодАналитики));
		
		Если МассивСоответствий.Количество()=1 Тогда
			
			НоваяСтрока.АналитикаСравнение=МассивСоответствий[0].АналитикаСравнение;
			НоваяСтрока.КодАналитикиСравнение=МассивСоответствий[0].КодАналитикиСравнение;
			
		КонецЕсли;
		
	КонецЦикла;			
	
КонецПроцедуры // ОбновитьТаблицуСоответствияАналитик() 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Не Параметры.Ключ.Пустой() Тогда
				
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	СоответствиеВнутригрупповыхПоказателей.СоответствиеАналитик
		|ИЗ
		|	РегистрСведений.СоответствиеВнутригрупповыхПоказателей КАК СоответствиеВнутригрупповыхПоказателей
		|ГДЕ
		|	СоответствиеВнутригрупповыхПоказателей.ВидОтчетаБазис = &ВидОтчетаБазис
		|	И СоответствиеВнутригрупповыхПоказателей.ВидОтчетаСравнение = &ВидОтчетаСравнение
		|	И СоответствиеВнутригрупповыхПоказателей.ПоказательБазис = &ПоказательБазис
		|	И СоответствиеВнутригрупповыхПоказателей.ПоказательСравнение = &ПоказательСравнение";
		
		Запрос.УстановитьПараметр("ВидОтчетаБазис",Запись.ВидОтчетаБазис);
		Запрос.УстановитьПараметр("ВидОтчетаСравнение",Запись.ВидОтчетаСравнение);
		Запрос.УстановитьПараметр("ПоказательБазис",Запись.ПоказательБазис);
		Запрос.УстановитьПараметр("ПоказательСравнение",Запись.ПоказательСравнение);
		
		Результат=Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			
			ЗначениеВРеквизитФормы(Результат.СоответствиеАналитик.Получить(),"УстановленныеСоответствия");
			
		КонецЕсли;
		
		ЗаполнитьАналитикиПоказателяБазис();
		ЗаполнитьАналитикиПоказателяСравнение();
		
	КонецЕсли;
		
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ, ИСПОЛНЯЕМЫЕ НА КЛИЕНТЕ

&НаКлиенте
Процедура ПоказательБазисПриИзменении(Элемент)
	
	УстановленныеСоответствия.Очистить();
	АналитикаВГОБазис="";
	ЗаполнитьАналитикиПоказателяБазис();
		
КонецПроцедуры

&НаКлиенте
Процедура ПоказательСравнениеПриИзменении(Элемент)
	
	УстановленныеСоответствия.Очистить();
	АналитикаВГОСравнение="";
	ЗаполнитьАналитикиПоказателяСравнение();
	ОбновитьТаблицуСоответствияАналитик();
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствияАналитикАналитикаСравнениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокВыбора = Новый СписокЗначений;
	
	ТекущиеДанные = Элементы.СоответствияАналитик.ТекущиеДанные;
	
	Для Каждого СтрАналитика ИЗ ТабАналитикиСравнение Цикл
		
		Если СтрАналитика.ВидАналитики = ТекущиеДанные.ВидАналитикиБазис
			ИЛИ СтрАналитика.ТипДанныхАналитики[0].Значение = ТекущиеДанные.ТипДанныхАналитикиБазис[0].Значение Тогда
			
			СписокВыбора.Добавить(СтрАналитика.КодАналитики, СтрАналитика.ПредставлениеАналитики);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СписокВыбора.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранноеЗначение = Неопределено;

	ДопПараметры = Новый Структура("ТекущиеДанные", ТекущиеДанные);
	Оповещение = Новый ОписаниеОповещения("СоответствияАналитикАналитикаСравнениеНачалоВыбораЗавершение", ЭтотОбъект, ДопПараметры);
	ПоказатьВыборИзСписка(Оповещение, СписокВыбора, Элемент);
				
КонецПроцедуры

&НаКлиенте
Процедура СоответствияАналитикАналитикаСравнениеНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
        
    ВыбранноеЗначение = ВыбранныйЭлемент;
    
    Если НЕ ВыбранноеЗначение = Неопределено Тогда
        
        ТекущиеДанные.КодАналитикиСравнение = ВыбранноеЗначение.Значение;
        ТекущиеДанные.АналитикаСравнение 	= ВыбранноеЗначение.Представление;
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоответствияАналитикАналитикаСравнениеОчистка(Элемент, СтандартнаяОбработка)
	
	 Элементы.СоответствияАналитик.ТекущиеДанные.КодАналитикиСравнение="";
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Запись.ПоказательБазис) Тогда
		Сообщить(НСтр("ru = 'Не указан показатель - источник.'"),СтатусСообщения.Внимание);
		Отказ=Истина;
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.ПоказательСравнение) Тогда
		Сообщить(НСтр("ru = 'Не указан показатель - приемник.'"),СтатусСообщения.Внимание);
		Отказ=Истина;
		Возврат;
	КонецЕсли;
	
	ТекущийОбъект.СоответствиеАналитик=Новый ХранилищеЗначения(РеквизитФормыВЗначение("УстановленныеСоответствия"));
		
КонецПроцедуры

&НаКлиенте
Процедура ВидОтчетаБазисПриИзменении(Элемент)
	
	УстановленныеСоответствия.Очистить();
	АналитикаВГОБазис="";
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтчетаСравнениеПриИзменении(Элемент)
	
	УстановленныеСоответствия.Очистить();
	АналитикаВГОСравнение="";
	
КонецПроцедуры
